openfoam_templates/validation_spray_g_iso_octane_case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 125223;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 104756;
    }
    walls
    {
        type            zeroGradient;
    }
    cylinder
    {
        type            zeroGradient;
    }
    intakeValve
    {
        type            zeroGradient;
    }
    exhaustValveLeft
    {
        type            zeroGradient;
    }
    exhaustValveRight
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
