openfoam_templates/validation_spray_g_iso_octane_case/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue p 101325
    volScalarFieldValue T 300
    volVectorFieldValue U (0 0 0)
);

regions ();
